---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementPhaseStatusFilter
source: html/a0653fc2-4f6f-0ed5-2f86-b59e5b8209d7.htm
---
# ElementPhaseStatusFilter Members

Constructs a new instance of a file to match elements that have a given phase status on the input phase.